In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df0 = pd.read_csv("train.csv")
df1 = pd.read_csv("test.csv")

In [3]:
df0["Set"] = [0]*len(df0)
df1["Set"] = [1]*len(df1)

In [4]:
df = pd.merge(df0, df1, how="outer")

In [5]:
## 범주형 Dummy 생성
df = pd.get_dummies(df, columns=["Sex"]).drop(["Sex_male"], axis=1)
df = df.join(pd.get_dummies(df[["Embarked"]], columns=["Embarked"]))

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Set', 'Sex_female',
       'Embarked_C', 'Embarked_Q', 'Embarked_S'],
      dtype='object')

In [7]:
## 일관된 형식을 위해 Name2 생성
df["Name2"] = df["Name"].replace({
    'Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")':
    'Duff Gordon, Mrs. Morgan',
    'Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")':
    'Duff Gordon, Mr. Morgan',
    'Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")':
    'Mayne, Mrs. Villiers',
    'Phillips, Miss. Kate Florence ("Mrs Kate Louise Phillips Marshall")':
    'Phillips, Mrs. Kate Louise Phillips Marshall',
    'Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)':
    'Rothes, Countess. Lucy Noel Martha Dyer-Edwards',
    'Yrois, Miss. Henriette ("Mrs Harbeck")':
    'Yrois, Mrs. Harbeck'})

In [8]:
## Title
df["Title"] = df["Name2"].apply(lambda x: x.split(",")[1].strip().split(".")[0].strip())
df["Title"] = df["Title"].replace({"Don": "Mr", "Dona": "Ms", "Mlle": "Ms", "Mme": "Ms"})

In [9]:
d = {" ": "", "-": "", "(": "", ")": "", "'": "", '"': ""}

In [10]:
## Last Name
df["LName"] = df["Name2"].apply(lambda x: x.split(",")[0].strip())
df["LName"] = df["LName"].apply(lambda x: x.title().translate(str.maketrans(d)))

In [11]:
## First Name
df["FName"] = df["Name2"].apply(lambda x: x.split(".")[1].strip())
df["FName"] = df["FName"].apply(lambda x: x.replace("/", " ").split(" ")[0].strip())
df["FName"] = df["FName"].apply(lambda x: x.translate(str.maketrans(d)))

In [12]:
df[["Name2", "Title", "LName", "FName"]].head()

                                               Name2 Title      LName    FName
0                            Braund, Mr. Owen Harris    Mr     Braund     Owen
1  Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs    Cumings     John
2                             Heikkinen, Miss. Laina  Miss  Heikkinen    Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs   Futrelle  Jacques
4                           Allen, Mr. William Henry    Mr      Allen  William

In [13]:
## *******************************************************************************************

In [28]:
## 일관된 형식을 위해 Ticket2 생성
df["Ticket2"] = df["Ticket"].apply(lambda x: "/".join(x.rsplit(" ", 1)))
df["Ticket2"] = df["Ticket2"].apply(lambda x: x.upper().replace(".", "").replace(" ", ""))

In [29]:
df["Ticket2"]

0              A/5/21171
1               PC/17599
2        STON/O2/3101282
3                 113803
4                 373450
              ...
1304             A5/3236
1305            PC/17758
1306    SOTON/OQ/3101262
1307              359309
1308                2668
Name: Ticket2, Length: 1309, dtype: object

In [26]:
d = {"A/4": "A4", "A/5": "A5", "A/S": "AS", "AQ/3": "AQ3", "AQ/4": "AQ4",
     "CA/SOTON": "CA", "SC/AHBASLE": "SC/AH", "SOC": "SO/C", "WEP": "WE/P"}

In [31]:
repls = ('hello', 'goodbye'), ('world', 'earth')
s = 'hello, world'
reduce(lambda a, kv: a.replace(*kv), repls, s)

NameError: name 'reduce' is not defined

In [30]:
df["Ticket2"] = df["Ticket2"].apply(lambda x: x.translate(str.maketrans(d)))

ValueError: string keys in translate table must be of length 1

In [15]:
df["THead"] = df["Ticket2"].apply(lambda x: x.rsplit("/", 1)[0] if "/" in x else None)

In [16]:
df["TTail"] = df["Ticket2"].apply(lambda x: x.split("/")[-1])

In [20]:
#df.to_csv("df.csv", index=False)

## 티켓당 요금 동일

In [21]:
## 티켓당 요금이 동일한가
from collections import Counter
Counter({k: len(set(v["Fare"].tolist())) for k, v in df[["Ticket2", "Fare"]].groupby("Ticket2")}.values()).most_common()

[(1, 928), (2, 1)]

In [22]:
df[df["Ticket2"]=="7534"]

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Embarked_C,Embarked_Q,Embarked_S,Name2,Title,LName,FName,Ticket2,THead,TTail
138,139,0.0,3,"Osen, Mr. Olaf Elon",16.0,0,0,7534,9.2167,NaN,...,0,0,1,"Osen, Mr. Olaf Elon",Mr,Osen,Olaf,7534,None,7534
876,877,0.0,3,"Gustafsson, Mr. Alfred Ossian",20.0,0,0,7534,9.8458,NaN,...,0,0,1,"Gustafsson, Mr. Alfred Ossian",Mr,Gustafsson,Alfred,7534,None,7534